In [1]:
import pandas as pd
import numpy as np

In [2]:
df= pd.read_csv('example')

In [3]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [4]:
df["sum"]=df.sum(axis=1)

In [5]:
df["sum"]=df["sum"].apply(lambda x: x * 2)

In [6]:
df.to_csv('exp.csv',index=False)

In [7]:
pd.read_csv("exp.csv")

    a   b   c   d  sum
0   0   1   2   3   12
1   4   5   6   7   44
2   8   9  10  11   76
3  12  13  14  15  108

## Working with Excel files

In [8]:
df2 = pd.read_excel('Excel_Sample.xlsx',sheet_name="Sheet1",index_col=0)

In [9]:
df2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [10]:
df2["sum"] = df2.sum(axis=1)

In [11]:
df2

    a   b   c   d  sum
0   0   1   2   3    6
1   4   5   6   7   22
2   8   9  10  11   38
3  12  13  14  15   54

In [12]:
df2.to_excel("out_excel.xlsx")

In [13]:
with pd.ExcelWriter('out_excel.xlsx',mode='a') as writer:  
    df2.to_excel(writer, sheet_name='Sheet_name_3')

In [14]:
pd.read_excel("out_excel.xlsx",index_col=0,sheet_name="Sheet_name_3")

    a   b   c   d  sum
0   0   1   2   3    6
1   4   5   6   7   22
2   8   9  10  11   38
3  12  13  14  15   54

## Read Html File using pandas

In [15]:
df=pd.read_html('https://en.wikipedia.org/wiki/Mobile_country_code?oldid=899173761',match="Telekom Albania")

In [29]:
df[0].to_html("exmp.html")